Repository: Nyavaka-Yaelle/rider_register_flutter
Catalog: lib/l10n/app_*.arb
Languages: fr, id

# helloWorld
source: HelloWorldEn!
fr: HelloWorldFr!
id: HelloWorldMg!

# beginRegister
source: Start registration
fr: Commencer l'inscription
id: Manomboka fisoratana anarana

source: step
fr: étape
id: dingana

source: Motorbike
fr: Moto
id: Môtô

source: Bicycle
fr: Vélo
id: Bisikileta

# penddingApprovalAppBar
source: Pendding approval
fr: En attente de validation
id: Miandry ny fankatoavana

# penddingApprovalTitle
source: We're evaluating your profile
fr: Nous évaluons votre profil
id: Manombana ny mombamomba anao izahay

# penddingApprovalMessage
source: Thank you for registering with our platform. Your registration is currently being reviewed and validated. We will contact you within 24 hours with confirmation of your account status. Thank you for your patience.
fr: Merci de vous être enregistré sur notre plateforme. Votre inscription est actuellement en cours de revue et de validation. Nous vous contacterons dans les 24 heures pour confirmation de votre statut de compte. Merci pour votre patience.
id: Misaotra anao nisoratra anarana tao amin'ny sehatray. Eo am-pandinihana sy voamarina ny fisoratana anaranao. Hifandray aminao izahay ao anatin'ny 24 ora hanamarina ny satan'ny kaontinao. Misaotra noho ny faharetanao.

source: Full name
fr: Nom complet
id: Anrana feno

source: Phone number
fr: Numéro de téléphone
id: Finday

# setProfilePicture
source: Change profile picture
fr: Changer la photo de profile
id: Ovaina ny sary

source: Next
fr: Suivant
id: Manaraka

source: ID card
fr: Carte d'identitée
id: Karapanondro

source: Set ID card
fr: Changer carte d'identitée
id: Ovaina karapanondro

source: Driver license
fr: Permis de conduire
id: Permy

# setDriverLicense
source: Change driver license
fr: Changer permis de conduire
id: Ovaina permy
